# 1. Користувач вводить рядок з клавіатури. Порахуйте кількість літер, цифр у рядку.
# Виведіть обидві кількості на екран. (використовувати цикл)
#######################################################################################################################
#
# some_txt = input("Enter some text: ")
# sum_txt = 0
# sum_num = 0
#
# for i in range(len(some_txt)):
#     if some_txt[i].isalpha():
#         sum_txt += 1
#     elif some_txt[i].isdigit():
#         sum_num += 1
# print(f"here are {sum_txt} letters and {sum_num} numbers in the string.")
#
#######################################################################################################################
# 2. Користувач вводить з клавіатури рядок та символ для пошуку.
# Порахуйте скільки разів у рядку зустрічається потрібний символ. Отримане число виведіть на екран.
#######################################################################################################################
#
# some_txt = input("Enter some text: ")
# some_char = input("Enter the symbol to search for: ")
# sum_char = 0
#
# for i in range(len(some_txt)):
#     if some_txt[i] == some_char:
#         sum_char += 1
#
# print(f"There are {sum_char} characters in this line ({some_char}).")
#
#######################################################################################################################
# 3. Користувач вводить з клавіатури рядок, слово для пошуку, слово для заміни.
# Зробіть у рядку заміну одного слова на інше. Отриманий рядок на екрані.
#######################################################################################################################
#
# some_txt = input("Enter some text: ")
# find_word = input("Enter the word you want to search for: ")
# replace_word = input("Enter the word you want to replace: ")
# some_txt = some_txt.replace(find_word, replace_word)
#
# print(f"New string: {some_txt}")
#
#######################################################################################################################
# 4. Дано рядок. (зробити зрізи)
#
# - Спершу виведіть третій символ цього рядка.
#
# - У другому рядку виведіть передостанній символ цього рядка.
#
# - У третьому рядку виведіть перші п'ять символів цього рядка.
#
# - У четвертому рядку виведіть весь рядок, крім двох останніх символів.
#
# - У п'ятому рядку виведіть усі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться з першого).
#
# - У шостому рядку виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
#
# - У сьомому рядку виведіть усі символи у зворотному порядку.
#
# - У восьмому рядку виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.
#
# - У дев'ятому рядку виведіть довжину цього рядка.
#######################################################################################################################



#######################################################################################################################
# Додатково:
#
# Є певний текст. Реалізуйте наступну функціональність:
#
# ■ Змінити текст таким чином, щоб кожна пропозиція починалася з великої літери;
#
# ■ Порахуйте скільки разів цифри зустрічаються у тексті;
#
# ■ Порахуйте скільки разів розділові знаки зустрічаються в тексті;
#
# ■ Порахуйте кількість знаків оклику в тексті.
#######################################################################################################################



#######################################################################################################################